; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob8) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 - pallet
	crate0 crate1 crate2 crate3 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 hoist14 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 depot2)
	(clear crate3)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate2)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot2)
	(clear pallet6)
	(at pallet7 depot0)
	(clear pallet7)
	(at pallet8 depot1)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear pallet9)
	(at pallet10 depot1)
	(clear pallet10)
	(at pallet11 distributor0)
	(clear pallet11)
	(at pallet12 depot1)
	(clear pallet12)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 370)
	(at truck1 distributor2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 217)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 depot1)
	(available hoist11)
	(at hoist12 depot0)
	(available hoist12)
	(at hoist13 distributor0)
	(available hoist13)
	(at hoist14 depot0)
	(available hoist14)
	(at crate0 depot2)
	(on crate0 pallet2)
	(= (weight crate0) 42)
	(at crate1 depot1)
	(on crate1 pallet1)
	(= (weight crate1) 25)
	(at crate2 distributor1)
	(on crate2 pallet4)
	(= (weight crate2) 80)
	(at crate3 depot2)
	(on crate3 crate0)
	(= (weight crate3) 83)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet3)
		(on crate2 pallet11)
		(on crate3 pallet9)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 0 to 10
   goals met: 1 of 4
2. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 10 to 11
   goals met: 1 of 4
3. (lift hoist4 crate2 pallet4 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist4) (on crate2 pallet4)
   added: (lifting hoist4 crate2) (clear pallet4)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 4
4. (lift hoist2 crate3 crate0 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist2) (on crate3 crate0)
   added: (lifting hoist2 crate3) (clear crate0)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 4
5. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 25
   goals met: 1 of 4
6. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 1 of 4
7. (load hoist4 crate2 truck0 distributor1)
   deleted: (lifting hoist4 crate2)
   added: (in crate2 truck0) (available hoist4)
   changed: (current_load truck0) from 25 to 105
   goals met: 1 of 4
8. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 23 to 33
   goals met: 1 of 4
9. (load hoist2 crate3 truck0 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 105 to 188
   goals met: 1 of 4
10. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 33 to 43
   goals met: 1 of 4
11. (unload hoist3 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   changed: (current_load truck0) from 188 to 163
   goals met: 1 of 4
12. (unload hoist8 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist8)
   added: (lifting hoist8 crate2)
   changed: (current_load truck0) from 163 to 83
   goals met: 1 of 4
13. (unload hoist10 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist10)
   added: (lifting hoist10 crate3)
   changed: (current_load truck0) from 83 to 0
   goals met: 1 of 4
14. (drop hoist3 crate1 pallet3 distributor0)
   deleted: (lifting hoist3 crate1) (clear pallet3)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 pallet3)
   goals met: 2 of 4
15. (drop hoist8 crate2 pallet11 distributor0)
   deleted: (lifting hoist8 crate2) (clear pallet11)
   added: (available hoist8) (at crate2 distributor0) (clear crate2) (on crate2 pallet11)
   goals met: 3 of 4
16. (drop hoist10 crate3 pallet9 distributor0)
   deleted: (lifting hoist10 crate3) (clear pallet9)
   added: (available hoist10) (at crate3 distributor0) (clear crate3) (on crate3 pallet9)
   goals met: 4 of 4
